{
    "title": "NeuroSculpt: Pronóstico de la Estructura Cerebral 9 Años Adelante Usando MRI Estructural",
    "description": "A medida que las personas envejecen, sus cerebros experimentan varias transformaciones estructurales, principalmente involucrando la pérdida de tejido. Los cambios acelerados pueden conducir a condiciones graves como la demencia o la enfermedad de Parkinson. La detección temprana de estos cambios anormales en individuos sanos es crucial, ya que puede permitir intervenciones tempranas para mitigar estas consecuencias. Sin embargo, los estudios continuos de Resonancia Magnética (MRI) necesarios para esta detección son tanto intensivos en tiempo como costosos. Actualmente, se han propuesto varias alternativas para predecir cambios estructurales cerebrales mediante avances en aprendizaje automático y aprendizaje profundo. Sin embargo, la mayoría se enfoca en pacientes con enfermedades neurodegenerativas y ninguno se especializa en poblaciones adultas sanas. En este estudio, nuestro objetivo fue predecir cambios estructurales en el cerebro a lo largo de un período de nueve años en una población adulta sana. Utilizamos imágenes 3D ponderadas en T1 y exploramos dos familias principales de métodos. La primera familia se basó en Campos de Deformación (DFs), mientras que la segunda empleó técnicas de aprendizaje profundo usando Redes Generativas Antagónicas (GANs). Los métodos basados en DF se construyeron sobre la hipótesis de que los cambios cerebrales observados en un subconjunto de individuos podrían predecir cambios en otros dentro de la misma población. Los métodos basados en GAN se inspiraron en los avances en la predicción de cambios cerebrales en bebés y pacientes con Alzheimer. Evaluamos los resultados de estos métodos utilizando varios criterios de evaluación, incluyendo la similitud de imágenes, la similitud de regiones cerebrales y la atrofia cerebral total. Nuestros resultados indicaron que las técnicas basadas en DF fueron más efectivas y estables que las GANs, demostrando una mayor capacidad para capturar cambios sutiles, particularmente en el tálamo y la corteza, así como cambios significativos en los ventrículos, en línea con nuestra hipótesis. En contraste, los métodos basados en GANs predijeron principalmente cambios volumétricos en los ventrículos. Este estudio proporcionó una base para futuras investigaciones en la predicción de cambios cerebrales, destacando la efectividad de los métodos basados en DF y sugiriendo mejoras para los enfoques de GAN.",
    "date": "2024-06-26",
    "link": "https://agustin-cartaya.vercel.app/projects/s4_master_thesis/report/Agustin_Cartaya___MAIA_Master_Thesis.pdf"
}