{
    "title": "NeuroSculpt : Prévision de la Structure Cérébrale 9 Ans à l'Avance à l'Aide d'une IRM Structurelle",
    "description": "Avec l'âge, le cerveau subit diverses transformations structurelles, principalement liées à la perte de tissu. Des changements accélérés peuvent entraîner des conditions graves telles que la démence ou la maladie de Parkinson. La détection précoce de tels changements anormaux chez les individus en bonne santé est cruciale, car elle peut permettre des interventions précoces pour atténuer ces conséquences. Cependant, les études d'Imagerie par Résonance Magnétique (IRM) continues, nécessaires pour cette détection, sont à la fois longues et coûteuses. Actuellement, plusieurs alternatives ont été proposées pour prédire les changements structurels du cerveau en utilisant les avancées de l'apprentissage automatique et de l'apprentissage profond. Cependant, la plupart se concentrent sur les patients atteints de maladies neurodégénératives et aucune ne se spécialise dans les populations adultes saines. Dans cette étude, notre objectif était de prédire les changements structurels du cerveau sur une période de neuf ans chez une population adulte en bonne santé. Nous avons utilisé des images 3D pondérées en T1 et exploré deux familles principales de méthodes. La première famille était basée sur les Champs de Déformation (DFs), tandis que la seconde utilisait des techniques d'apprentissage profond avec des Réseaux Antagonistes Génératifs (GANs). Les méthodes basées sur les DF étaient fondées sur l'hypothèse que les changements cérébraux observés dans un sous-ensemble d'individus pourraient prédire les changements chez d'autres au sein de la même population. Les méthodes basées sur les GANs s'inspiraient des avancées dans la prévision des changements cérébraux chez les nourrissons et les patients atteints de la maladie d'Alzheimer. Nous avons évalué les résultats de ces méthodes en utilisant divers critères d'évaluation, notamment la similitude des images, la similitude des régions cérébrales et l'atrophie cérébrale totale. Nos résultats ont indiqué que les techniques basées sur DF étaient plus efficaces et stables que les GANs, montrant une plus grande capacité à capturer les changements subtils, en particulier dans le thalamus et le cortex, ainsi que des changements significatifs dans les ventricules, conformément à notre hypothèse. En revanche, les méthodes basées sur les GANs prédisaient principalement des changements volumétriques dans les ventricules. Cette étude a fourni une base pour les recherches futures sur la prévision des changements cérébraux, soulignant l'efficacité des méthodes basées sur DF et suggérant des améliorations pour les approches GAN.",
    "date": "2024-06-26",
    "link": "https://agustin-cartaya.vercel.app/projects/s4_master_thesis/report/Agustin_Cartaya___MAIA_Master_Thesis.pdf"
}