
{
    "title":"NeuroSculpt: Forecasting Brain Structure 9 Years Ahead Using Structural MRI",
    "description": "As people age, their brains undergo various structural transformations, primarily involving tissue loss. Accelerated changes can lead to serious conditions such as dementia or Parkinson’s disease. Early detection of such abnormal changes in healthy individuals is crucial, as it may allow for early interventions to mitigate these consequences. However, continuous Magnetic Resonance Imaging (MRI) studies, necessary for such detection, are both time-intensive and costly. Currently, several alternatives have been proposed to predict brain structural changes using advances in machine learning and deep learning. However, most focus on patients with neurodegenerative diseases and none specialize in healthy adult populations. In this study, we aimed to predict structural brain changes over a span of nine years in a healthy adult population. We used 3D T1-weighted MR images and explored two primary family of methods. The first family was based on Deformation Fields (DFs), while the second employed deep learning techniques using Generative Adversarial Networks (GANs). DF-based methods were built on the hypothesis, that brain changes observed in one subset of individuals could predict changes in others within the same population. The GAN-based methods were inspired by advancements in predicting brain changes in infants and Alzheimer’s disease patients. We evaluated the results of these methods using various assessment criteria, including image similarity, similarity of brain regions, and total brain atrophy. Our results indicated that DF-based techniques were more effective and stable than GANs, demonstrating a greater ability to capture subtle changes, particularly in the thalamus and cortex, as well as significant changes in the ventricles in line with our hypothesis. In contrast, GAN-based methods primarily predicted volumetric changes in the ventricles. This study provided a foundation for future research in brain change prediction, highlighting the effectiveness of DF-based methods and suggesting improvements for GAN approaches.",
    "date": "June 2024",
    "link": "link"
}

